In [144]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn import preprocessing
from sklearn.model_selection import KFold

In [145]:
col_names=['Marks1','Marks2','Admission']
ds=pd.read_csv("/home/admin1/Downloads/Student-University(For Logistic Regression Program).csv",header=None,names=col_names)

In [146]:
print(ds)

       Marks1     Marks2  Admission
0   34.623660  78.024693          0
1   30.286711  43.894998          0
2   35.847409  72.902198          0
3   60.182599  86.308552          1
4   79.032736  75.344376          1
..        ...        ...        ...
95  83.489163  48.380286          1
96  42.261701  87.103851          1
97  99.315009  68.775409          1
98  55.340018  64.931938          1
99  74.775893  89.529813          1

[100 rows x 3 columns]

In [147]:
x=ds.iloc[:,[0,1]].values

In [148]:
y=ds.iloc[:,2].values

In [149]:
xp=preprocessing.scale(x)

In [150]:
kf=KFold(n_splits=5)

In [151]:
for train_index,test_index in kf.split(xp):
    xtrain,xtest,ytrain,ytest=train_test_split(xp,y,test_size=0.20,random_state=0)
    x1=xtrain[:,0]
    x2=xtrain[:,1]
    b0=0.0
    b1=0.0
    b2=0.0
    epoch=10000
    alpha=0.001
    while(epoch>0):
        for i in range(len(xtrain)):
            prediction=1/(1+np.exp(-(b0+b1*x1[i]+b2*x2[i])))
            b0=b0+alpha*(ytrain[i]-prediction)*prediction*(1-prediction)*1.0
            b1=b1+alpha*(ytrain[i]-prediction)*prediction*(1-prediction)*x1[i]
            b2=b2+alpha*(ytrain[i]-prediction)*prediction*(1-prediction)*x2[i]
            epoch=epoch-1

In [152]:
print(b0)
print(b1)
print(b2)

0.16701973288386196
0.4868177427484464
0.4948075155845019

In [153]:
final_prediction=[]
x3=xtest[:,0]
x4=xtest[:,1]
print(ytest)

[1 0 0 0 1 1 1 1 0 1 0 0 0 1 1 1 0 1 1 1]

In [154]:
y_pred=[0]*len(xtest)
for i in range(len(xtest)):
    y_pred[i]=np.round(1/(1+np.exp(-(b0+b1*x3[i]+b2*x4[i]))))
    final_prediction.append(np.ceil(y_pred[i]))

In [129]:
print(final_prediction)

[0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0]

In [155]:
from sklearn.metrics import accuracy_score
print("Accuracy", accuracy_score(ytest,y_pred))

Accuracy 0.8

In [156]:
X = pd.read_csv("/home/admin1/Downloads/titanic.csv")
X.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [157]:
X = X.select_dtypes(include=[object])
X.head(3)

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S

In [158]:
X.shape

(891, 5)

In [134]:
from sklearn import preprocessing

In [135]:
# view columns using df.columns
X.columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [136]:
# TODO: create a LabelEncoder object and fit it to each feature in X


# 1. INSTANTIATE
# encode labels with value between 0 and n_classes-1.
le = preprocessing.LabelEncoder()


# 2/3. FIT AND TRANSFORM
# use df.apply() to apply le.fit_transform to all columns
X_2 = X.apply(le.fit_transform)
X_2.head()

   Name  Sex  Ticket  Cabin  Embarked
0   108    1     523    147         2
1   190    0     596     81         0
2   353    0     669    147         2
3   272    0      49     55         2
4    15    1     472    147         2

In [137]:
# TODO: create a OneHotEncoder object, and fit it to all of X

# 1. INSTANTIATE
enc = preprocessing.OneHotEncoder()

# 2. FIT
enc.fit(X_2)

# 3. Transform
onehotlabels = enc.transform(X_2).toarray()
onehotlabels.shape

# as you can see, you've the same number of rows 891
# but now you've so many more columns due to how we changed all the categorical data into numerical data

(891, 1726)

In [138]:
onehotlabels

array([[0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 1., 0.],
       ...,
       [0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 1., 0., 0.]])

In [139]:
type(onehotlabels)

numpy.ndarray

In [140]:
import numpy as np
import pandas as pd


# for operation 2
df2 =pd.read_csv("/home/admin1/Downloads/diabetes_null.csv",na_values=['#NAME?'])

In [141]:
#handling missing rows
#Delete Row
df1 = pd.read_csv("/home/admin1/Downloads/diabetes_null.csv",na_values=['#NAME?'])
df1.isnull().sum().sort_values(ascending=False)
df_no_missing = df1.dropna(axis=0)
print(df_no_missing.head(5))

    Pregnancies  Glucose  BloodPressure  SkinThickness  Insulin   BMI  \
3             1     89.0           66.0           23.0     94.0  28.1
4             0    137.0            4.0           35.0    168.0  43.1
6             3     78.0            5.0           32.0     88.0  31.0
8             2    197.0            7.0           45.0    543.0   3.5
13            1    189.0            6.0           23.0    846.0   3.1

    DiabetesPedigreeFunction  Age  Outcome
3                      0.167   21        0
4                      2.288   33        1
6                      0.248   26        1
8                      0.158   53        1
13                     0.398   59        1

In [142]:
#fill with mean
from sklearn.impute import SimpleImputer
import numpy as np

imp = SimpleImputer(missing_values=np.nan, strategy='mean')

imp.fit(df1)
df1 = pd.DataFrame(data=imp.transform(df1), columns=df1.columns)

#print
print(df1.head(5))

   Pregnancies  Glucose  BloodPressure  SkinThickness     Insulin   BMI  \
0          6.0    148.0           72.0      35.000000  105.659898  33.6
1          1.0     85.0           66.0      29.000000  105.659898  26.6
2          8.0    183.0           64.0      25.876155  105.659898  23.3
3          1.0     89.0           66.0      23.000000   94.000000  28.1
4          0.0    137.0            4.0      35.000000  168.000000  43.1

   DiabetesPedigreeFunction   Age  Outcome
0                     0.627   5.0      1.0
1                     0.351  31.0      0.0
2                     0.672  32.0      1.0
3                     0.167  21.0      0.0
4                     2.288  33.0      1.0

In [143]:
from sklearn.impute import SimpleImputer
import numpy as np

imp = SimpleImputer(missing_values=np.nan, strategy='median')

imp.fit(df1)
df1 = pd.DataFrame(data=imp.transform(df1), columns=df1.columns)

#print
print(df1.head(5))

   Pregnancies  Glucose  BloodPressure  SkinThickness     Insulin   BMI  \
0          6.0    148.0           72.0      35.000000  105.659898  33.6
1          1.0     85.0           66.0      29.000000  105.659898  26.6
2          8.0    183.0           64.0      25.876155  105.659898  23.3
3          1.0     89.0           66.0      23.000000   94.000000  28.1
4          0.0    137.0            4.0      35.000000  168.000000  43.1

   DiabetesPedigreeFunction   Age  Outcome
0                     0.627   5.0      1.0
1                     0.351  31.0      0.0
2                     0.672  32.0      1.0
3                     0.167  21.0      0.0
4                     2.288  33.0      1.0